Catalogs/СтатьиДоходовРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>СтатьиДоходовРасходов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокСбережения</Name>
					<Comment>Дата, к которой требуется выполнить накопление средств</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСбережения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяВозвратаСбережения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяСбережения</Name>
					<Comment>заполняется в статье возврата сбережения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРодитель</Name>
					<Comment>для расходов за счет сбережений, ссылка на статью, которая является простым расход, а не за счет сбережений, чтобы можно было в отчете БюджетДДС показывать общий расход, без разделения на расход и расход за счет сбережений</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗнакДвижения</Name>
					<Comment>1 или -1, для расчета конечного остатка средств, нужен только для самого верхнего уровня групп</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСбережение</Name>
					<Comment>сбережение или возврат</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьСтатьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ОпцииСтатей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ОпцииСтатей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Включена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяДР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Опция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОпцииБюджетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/СтатьиДоходовРасходов/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОпцииБюджетов.Ссылка
		|ИЗ
		|	Справочник.ОпцииБюджетов КАК ОпцииБюджетов";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = ОпцииСтатей.Добавить();
		НовСтр.Опция = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура ОпцииСтатейВключенаПриИзменении(Элемент)
	ОпцииСтатейВключенаПриИзмененииС(Элементы.Список.ТекущиеДанные.Ссылка, Элементы.ОпцииСтатей.ТекущиеДанные.опция, Элементы.ОпцииСтатей.ТекущиеДанные.включена);
КонецПроцедуры

&НаСерверебезКонтекста
Процедура ОпцииСтатейВключенаПриИзмененииС(Статья, Опция, включена)
	
	если Статья.этогруппа тогда
		
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиДоходовРасходов.Ссылка
		|ИЗ
		|	Справочник.СтатьиДоходовРасходов КАК СтатьиДоходовРасходов
		|ГДЕ
		|	СтатьиДоходовРасходов.Ссылка В ИЕРАРХИИ(&Ссылка)";

	Запрос.УстановитьПараметр("Ссылка", статья);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ОпцииСтатей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Опция.Установить(опция);
		НаборЗаписей.Отбор.Статьядр.Установить(ВыборкаДетальныеЗаписи.ссылка);
		НовСтр = НаборЗаписей.Добавить();
		НовСтр.Опция= опция;
		новстр.СтатьяДР = ВыборкаДетальныеЗаписи.ссылка;
		новСтр.Включена = включена;
		НаборЗаписей.Записать();
		
	КонецЦикла;

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

		
	Иначе
		
		НаборЗаписей = РегистрыСведений.ОпцииСтатей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Опция.Установить(опция);
		НаборЗаписей.Отбор.Статьядр.Установить(Статья);
		НовСтр = НаборЗаписей.Добавить();
		НовСтр.Опция= опция;
		новстр.СтатьяДР = статья;
		новСтр.Включена = включена;
		НаборЗаписей.Записать();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные<>Неопределено Тогда
		для Каждого стр из ОпцииСтатей цикл
			Стр.Включена = СписокПриАктивизацииСтрокиС(Элемент.ТекущиеДанные.Ссылка, Стр.Опция);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСерверебезКонтекста
Функция СписокПриАктивизацииСтрокиС(Статья, Опция)
	//заполнить флаг Включена. доделать - увести на сервер
	НаборЗаписей = РегистрыСведений.ОпцииСтатей.СоздатьНаборЗаписей();
	
		НаборЗаписей.Отбор.Опция.Установить(опция);
		НаборЗаписей.Отбор.СтатьяДР.Установить(Статья);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество()>0 Тогда
			Возврат НаборЗаписей[0].Включена;
		Иначе
			Возврат ЛОжь;
		КонецЕсли;
	    //записывать не надо
КонецФункции
